import discord
import requests
import json

date_url = 'http://apis.data.go.kr/B490007/qualExamSchd/getQualExamSchdList'
Key = 'FBdcMiGBSVTmkMVhEhvvk49u8+NdfsicSApB1b0oo2EYSc1/WeIB2Tn8GqQsTKJLu7d6SJwhpZulcq8parI89A=='

information = ["docRegStartDt", "docRegEndDt", "docExamStartDt", "docExamEndDt", "docPassDt",
               "pracRegStartDt", "pracRegEndDt", "pracExamStartDt", "pracExamEndDt", "pracPassDt"]
information_name = ['필기시험 원서접수', "필기시험", "필기시험 합격예정자 발표", "실기시험 원서접수", "실기시험", "최종합격자 발표"]

def certificate_code(name):
    list = [['공인노무사', '9500'], ['일반경비지도사', '9501'], ['기계경비지도사', '9502'], ['가맹거래사', '9503'], ['관광통역안내사(불어)', '9624'],
            ['관광통역안내사(독어)', '9625'], ['관광통역안내사(스페인어)', '9626'], ['관광통역안내사(러시아어)', '9627'], ['관광통역안내사(일본어)', '9628'],
            ['관광통역안내사(중국어)', '9629'], ['공인중개사', '9630'], ['관광통역안내사(이탈리아어)', '9631'], ['관광통역안내사(태국어)', '9632'],
            ['관광통역안내사(베트남어)', '9633'], ['관광통역안내사(말레이/인도네시아어)', '9634'], ['관광통역안내사(아랍어)', '9635'], ['관세사', '9640'],
            ['세무사', '9641'], ['방사성동위원소취급자특수면허', '9653'], ['방사성동위원소취급자일반면허', '9654'], ['방사선취급감독자면허', '9655'],
            ['소방안전교육사', '9657'], ['소방시설관리사', '9658'], ['박물관및미술관준학예사', '9659'], ['한국어교육능력검정시험', '9660'],
            ['관광통역안내사(영어)', '9661'], ['호텔경영사', '9662'], ['호텔관리사', '9663'], ['국내여행안내사', '9664'], ['호텔서비스사', '9665'],
            ['문화재수리기술자(보수)', '9666'], ['문화재수리기술자(단청)', '9667'], ['문화재수리기술자(실측설계)', '9668'],
            ['문화재수리기술자(조경)', '9669'], ['문화재수리기술자(보존과학)', '9670'], ['문화재수리기술자(식물보호)', '9671'],
            ['문화재수리기능자(대목수)', '9672'], ['문화재수리기능자(소목수)', '9673'], ['문화재수리기능자(가공석공)', '9674'],
            ['문화재수리기능자(쌓기석공)', '9675'], ['문화재수리기능자(화공)', '9676'], ['문화재수리기능자(드잡이공)', '9677'],
            ['문화재수리기능자(번와와공)', '9678'], ['문화재수리기능자(제작와공)', '9679'], ['문화재수리기능자(한식미장공)', '9680'],
            ['문화재수리기능자(철물공)', '9681'], ['문화재수리기능자(목조각공)', '9682'], ['문화재수리기능자(석조각공)', '9683'],
            ['문화재수리기능자(칠공)', '9684'], ['문화재수리기능자(도금공)', '9685'], ['문화재수리기능자(표구공)', '9686'],
            ['문화재수리기능자(조경공)', '9687'], ['문화재수리기능자(세척공)', '9688'], ['문화재수리기능자(훈증공)', '9689'],
            ['문화재수리기능자(보존처리공)', '9690'], ['문화재수리기능자(식물보호공)', '9691'], ['문화재수리기능자(실측설계사보)', '9692'],
            ['문화재수리기능자(박제및표본제작공)', '9693'], ['문화재수리기능자(온돌공)', '9694'], ['농산물품질관리사', '9695'], ['경매사(청과)', '9696'],
            ['경매사(수산)', '9697'], ['경매사(축산)', '9698'], ['경매사(화훼)', '9699'], ['경매사(약용)', '9700'],
            ['경영지도사(인적자원관리)', '9701'], ['경영지도사(재무관리)', '9702'], ['경영지도사(생산관리)', '9703'], ['경영지도사(마케팅)', '9704'],
            ['경영지도사(1차공통)', '9705'], ['문화재수리기능자(모사공)', '9706'], ['산업안전지도사(기계안전)', '9711'],
            ['산업안전지도사(전기안전)', '9712'], ['산업안전지도사(화공안전)', '9713'], ['산업안전지도사(건설안전)', '9714'],
            ['산업보건지도사(직업환경의학)', '9715'], ['산업보건지도사(산업위생공학)', '9716'], ['일반행정사', '9721'], ['외국어번역행정사', '9722'],
            ['기술행정사', '9723'], ['경매사(양곡)', '9728'], ['기술지도사(1차공통)', '9729'], ['기술지도사(기계)', '9730'],
            ['기술지도사(금속)', '9731'], ['기술지도사(전기전자)', '9732'], ['기술지도사(섬유)', '9733'], ['기술지도사(화공)', '9734'],
            ['기술지도사(생산관리)', '9735'], ['기술지도사(정보처리)', '9736'], ['변리사', '9737'], ['사회복지사 1급', '9738'],
            ['정수시설운영관리사1급', '9739'], ['정수시설운영관리사2급', '9740'], ['정수시설운영관리사3급', '9741'], ['주택관리사보', '9744'],
            ['감정평가사', '9745'], ['물류관리사', '9746'], ['검수사', '9747'], ['검량사', '9748'], ['감정사', '9749'],
            ['1급 청소년지도사', '9750'], ['2급 청소년지도사', '9751'], ['3급 청소년지도사', '9752'], ['1급 청소년상담사', '9753'],
            ['2급 청소년상담사', '9754'], ['3급 청소년상담사', '9755'], ['기술지도사(환경)', '9756'], ['기술지도사(생명공학)', '9757'],
            ['수산물품질관리사', '9762'], ['손해평가사', '9763'], ['고용노동부 보건직(7급)', '9800'], ['용접기술사', '11'], ['금형기술사', '12'],
            ['차량기술사', '50'], ['산업기계설비기술사', '60'], ['공조냉동기계기술사', '71'], ['건설기계기술사', '80'], ['금속제련기술사', '94'],
            ['금속재료기술사', '110'], ['표면처리기술사', '120'], ['금속가공기술사', '130'], ['화공기술사', '210'], ['발송배전기술사', '230'],
            ['전기응용기술사', '250'], ['철도신호기술사', '261'], ['산업계측제어기술사', '270'], ['전자응용기술사', '301'], ['조선기술사', '320'],
            ['항공기체기술사', '360'], ['항공기관기술사', '370'], ['토질및기초기술사', '390'], ['토목구조기술사', '400'], ['항만및해안기술사', '410'],
            ['도로및공항기술사', '420'], ['철도기술사', '430'], ['철도차량기술사', '431'], ['전기철도기술사', '432'], ['수자원개발기술사', '451'],
            ['상하수도기술사', '460'], ['농어업토목기술사', '470'], ['토목시공기술사', '480'], ['토목품질시험기술사', '481'], ['건축구조기술사', '490'],
            ['건축기계설비기술사', '501'], ['건축전기설비기술사', '502'], ['건축시공기술사', '510'], ['건축품질시험기술사', '511'], ['섬유기술사', '551'],
            ['의류기술사', '561'], ['자원관리기술사', '570'], ['광해방지기술사', '575'], ['화약류관리기술사', '591'], ['정보관리기술사', '601'],
            ['컴퓨터시스템응용기술사', '622'], ['도시계획기술사', '650'], ['조경기술사', '670'], ['측량및지형공간정보기술사', '680'], ['지적기술사', '690'],
            ['해양기술사', '700'], ['수산양식기술사', '701'], ['어로기술사', '702'], ['기계안전기술사', '710'], ['화공안전기술사', '720'],
            ['전기안전기술사', '730'], ['건설안전기술사', '740'], ['소방기술사', '750'], ['산업위생관리기술사', '751'], ['가스기술사', '752'],
            ['공장관리기술사', '760'], ['품질관리기술사', '770'], ['포장기술사', '780'], ['세라믹기술사', '790'], ['식품기술사', '800'],
            ['산림기술사', '801'], ['비파괴검사기술사', '802'], ['수산제조기술사', '810'], ['지질및지반기술사', '825'], ['종자기술사', '840'],
            ['시설원예기술사', '841'], ['축산기술사', '851'], ['기계기술사', '872'], ['인간공학기술사', '875'], ['기상예보기술사', '891'],
            ['대기관리기술사', '920'], ['수질관리기술사', '930'], ['자연환경관리기술사', '938'], ['소음진동기술사', '940'], ['토양환경기술사', '948'],
            ['농화학기술사', '950'], ['교통기술사', '951'], ['제품디자인기술사', '960'], ['폐기물처리기술사', '970'], ['일반기계기사', '1021'],
            ['용접기사', '1022'], ['농업기계기사', '1023'], ['사출금형설계기사', '1024'], ['프레스금형설계기사', '1025'],
            ['그린전동자동차기사', '1027'], ['온실가스관리기사', '1028'], ['환경위해관리기사', '1029'], ['철도차량기사', '1030'],
            ['건설기계설비기사', '1040'], ['콘크리트기사', '1048'], ['건설기계정비기사', '1050'], ['궤도장비정비기사', '1051'],
            ['메카트로닉스기사', '1060'], ['자동차정비기사', '1070'], ['기계설계기사', '1080'], ['금속재료기사', '1104'], ['화공기사', '1110'],
            ['신재생에너지발전설비기사(태양광)', '1114'], ['임베디드기사', '1121'], ['화약류제조기사', '1130'], ['화약류관리기사', '1140'],
            ['전기기사', '1150'], ['전기공사기사', '1160'], ['전자기사', '1170'], ['반도체설계기사', '1175'], ['의공기사', '1176'],
            ['로봇기구개발기사', '1177'], ['로봇소프트웨어개발기사', '1178'], ['로봇하드웨어개발기사', '1179'], ['전파전자통신기사', '1195'],
            ['조선기사', '1220'], ['항공기사', '1240'], ['토목기사', '1250'], ['실내건축기사', '1282'], ['섬유기사', '1297'],
            ['의류기사', '1301'], ['정보처리기사', '1320'], ['전자계산기기사', '1321'], ['전자계산기조직응용기사', '1322'], ['정보보안기사', '1325'],
            ['에너지관리기사', '1340'], ['도시계획기사', '1350'], ['항로표지기사', '1351'], ['조경기사', '1370'], ['측량및지형공간정보기사', '1380'],
            ['지적기사', '1390'], ['인쇄기사', '1391'], ['해양환경기사', '1401'], ['해양자원개발기사', '1402'], ['해양공학기사', '1403'],
            ['산업안전기사', '1431'], ['건설안전기사', '1440'], ['화재감식평가기사', '1441'], ['농작업안전보건기사', '1442'], ['방재기사', '1443'],
            ['광산보안기사', '1450'], ['가스기사', '1471'], ['산업위생관리기사', '1472'], ['품질경영기사', '1500'], ['포장기사', '1511'],
            ['제품디자인기사', '1512'], ['광학기사', '1513'], ['식품기사', '1530'], ['수산제조기사', '1540'], ['식육가공기사', '1541'],
            ['응용지질기사', '1550'], ['승강기기사', '1555'], ['종자기사', '1560'], ['식물보호기사', '1562'], ['화학분석기사', '1563'],
            ['산림기사', '1564'], ['임업종묘기사', '1570'], ['광해방지기사', '1575'], ['화훼장식기사', '1576'], ['축산기사', '1581'],
            ['임산가공기사', '1590'], ['유기농업기사', '1592'], ['기상기사', '1600'], ['기상감정기사', '1601'], ['방사선비파괴검사기사', '1611'],
            ['초음파비파괴검사기사', '1612'], ['자기비파괴검사기사', '1613'], ['침투비파괴검사기사', '1614'], ['와전류비파괴검사기사', '1615'],
            ['누설비파괴검사기사', '1617'], ['수산양식기사', '1625'], ['건축기사', '1630'], ['건축설비기사', '1632'], ['어업생산관리기사', '1633'],
            ['버섯산업기사', '1641'], ['대기환경기사', '1661'], ['수질환경기사', '1662'], ['소음진동기사', '1663'], ['공조냉동기계기사', '1730'],
            ['철도신호기사', '1740'], ['전기철도기사', '1741'], ['건설재료시험기사', '1750'], ['교통기사', '1751'], ['철도토목기사', '1760'],
            ['시설원예기사', '1780'], ['시각디자인기사', '1790'], ['바이오화학제품제조기사', '1800'], ['설비보전기사', '1837'],
            ['인간공학기사', '1875'], ['소방설비기사(기계분야)', '1900'], ['소방설비기사(전기분야)', '1910'], ['자연생태복원기사', '1938'],
            ['토양환경기사', '1948'], ['폐기물처리기사', '1950'], ['컬러리스트기사', '1982'], ['생물분류기사(식물)', '1988'],
            ['생물분류기사(동물)', '1989'], ['기계조립산업기사', '2011'], ['판금제관산업기사', '2012'], ['컴퓨터응용가공산업기사', '2025'],
            ['용접산업기사', '2026'], ['농업기계산업기사', '2027'], ['사출금형산업기사', '2028'], ['프레스금형산업기사', '2029'],
            ['철도차량산업기사', '2030'], ['기계설계산업기사', '2031'], ['생산자동화산업기사', '2034'], ['기계정비산업기사', '2035'],
            ['전기철도산업기사', '2036'], ['온실가스관리산업기사', '2037'], ['건설기계설비산업기사', '2040'], ['배관산업기사', '2041'],
            ['철도운송산업기사', '2045'], ['영사산업기사', '2047'], ['콘크리트산업기사', '2048'], ['건설기계정비산업기사', '2050'],
            ['궤도장비정비산업기사', '2051'], ['자동차정비산업기사', '2070'], ['패션머천다이징산업기사', '2085'], ['치공구설계산업기사', '2090'],
            ['금속재료산업기사', '2101'], ['정밀측정산업기사', '2104'], ['주조산업기사', '2105'], ['표면처리산업기사', '2106'],
            ['재료조직평가산업기사', '2107'], ['광학기기산업기사', '2108'], ['신재생에너지발전설비산업기사(태양광)', '2114'], ['화약류제조산업기사', '2120'],
            ['위험물산업기사', '2121'], ['화약류관리산업기사', '2130'], ['광산보안산업기사', '2135'], ['전기산업기사', '2140'],
            ['가구제작산업기사', '2142'], ['전기공사산업기사', '2150'], ['철도신호산업기사', '2160'], ['전자산업기사', '2170'],
            ['반도체설계산업기사', '2175'], ['의공산업기사', '2176'], ['3D프린터개발산업기사', '2177'], ['사무자동화산업기사', '2193'],
            ['전파전자통신산업기사', '2195'], ['조선산업기사', '2220'], ['항공산업기사', '2230'], ['토목산업기사', '2240'],
            ['건축일반시공산업기사', '2251'], ['건축목공산업기사', '2253'], ['섬유디자인산업기사', '2264'], ['한복산업기사', '2268'],
            ['섬유산업기사', '2277'], ['실내건축산업기사', '2282'], ['정보처리산업기사', '2290'], ['패션디자인산업기사', '2301'],
            ['신발산업기사', '2302'], ['조경산업기사', '2320'], ['전자계산기제어산업기사', '2324'], ['정보보안산업기사', '2325'],
            ['측량및지형공간정보산업기사', '2330'], ['지적산업기사', '2340'], ['해양조사산업기사', '2350'], ['항로표지산업기사', '2351'],
            ['산업안전산업기사', '2381'], ['건설안전산업기사', '2390'], ['인쇄산업기사', '2391'], ['승강기산업기사', '2395'],
            ['품질경영산업기사', '2420'], ['포장산업기사', '2431'], ['제품디자인산업기사', '2432'], ['시각디자인산업기사', '2434'],
            ['화재감식평가산업기사', '2441'], ['식품산업기사', '2450'], ['종자산업기사', '2470'], ['가스산업기사', '2471'],
            ['산업위생관리산업기사', '2472'], ['산림산업기사', '2481'], ['축산산업기사', '2491'], ['임산가공산업기사', '2500'],
            ['수산양식산업기사', '2520'], ['잠수산업기사', '2521'], ['건축산업기사', '2530'], ['건축설비산업기사', '2531'],
            ['피아노조율산업기사', '2551'], ['식물보호산업기사', '2562'], ['바이오화학제품제조산업기사', '2570'], ['대기환경산업기사', '2571'],
            ['수질환경산업기사', '2572'], ['소음진동산업기사', '2573'], ['농림토양평가관리산업기사', '2582'], ['공조냉동기계산업기사', '2590'],
            ['유기농업산업기사', '2592'], ['건설재료시험산업기사', '2600'], ['철도토목산업기사', '2610'], ['방사선비파괴검사산업기사', '2611'],
            ['초음파비파괴검사산업기사', '2612'], ['자기비파괴검사산업기사', '2613'], ['침투비파괴검사산업기사', '2614'], ['화훼장식산업기사', '2625'],
            ['방수산업기사', '2630'], ['어로산업기사', '2631'], ['교통산업기사', '2751'], ['귀금속가공산업기사', '2760'],
            ['전자부품장착산업기사', '2835'], ['보석디자인산업기사', '2880'], ['소방설비산업기사(기계분야)', '2900'], ['소방설비산업기사(전기분야)', '2910'],
            ['자연생태복원산업기사', '2938'], ['폐기물처리산업기사', '2950'], ['에너지관리산업기사', '2960'], ['한식조리산업기사', '2971'],
            ['양식조리산업기사', '2972'], ['일식조리산업기사', '2973'], ['중식조리산업기사', '2974'], ['복어조리산업기사', '2975'],
            ['보석감정산업기사', '2980'], ['컬러리스트산업기사', '2982'], ['기계가공기능장', '3021'], ['금형제작기능장', '3061'],
            ['배관기능장', '3081'], ['판금제관기능장', '3095'], ['용접기능장', '3100'], ['자동차정비기능장', '3110'], ['건설기계정비기능장', '3120'],
            ['철도차량정비기능장', '3150'], ['에너지관리기능장', '3170'], ['주조기능장', '3200'], ['표면처리기능장', '3210'],
            ['금속재료기능장', '3221'], ['제선기능장', '3230'], ['제강기능장', '3240'], ['압연기능장', '3270'], ['위험물기능장', '3360'],
            ['가스기능장', '3375'], ['전기기능장', '3380'], ['전자기기기능장', '3410'], ['건축목재시공기능장', '3611'], ['건축일반시공기능장', '3621'],
            ['귀금속가공기능장', '3770'], ['잠수기능장', '3911'], ['조리기능장', '3922'], ['제과기능장', '3923'], ['미용장', '3924'],
            ['이용장', '3925'], ['컴퓨터응용선반기능사', '6012'], ['컴퓨터응용밀링기능사', '6032'], ['반도체장비유지보수기능사', '6033'],
            ['연삭기능사', '6040'], ['기계가공조립기능사', '6042'], ['궤도장비정비기능사', '6051'], ['금형기능사', '6105'], ['정밀측정기능사', '6120'],
            ['전산응용기계제도기능사', '6151'], ['판금제관기능사', '6175'], ['의료전자기능사', '6176'], ['배관기능사', '6213'],
            ['특수용접기능사', '6222'], ['용접기능사', '6223'], ['공유압기능사', '6251'], ['자동차정비기능사', '6281'],
            ['자동차차체수리기능사', '6285'], ['항공기체정비기능사', '6291'], ['항공기관정비기능사', '6292'], ['항공장비정비기능사', '6293'],
            ['항공전자정비기능사', '6294'], ['건설기계정비기능사', '6298'], ['농기계정비기능사', '6300'], ['농기계운전기능사', '6301'],
            ['공조냉동기계기능사', '6320'], ['가스기능사', '6335'], ['항로표지기능사', '6351'], ['철도차량정비기능사', '6352'], ['축로기능사', '6381'],
            ['생산자동화기능사', '6415'], ['열처리기능사', '6420'], ['주조기능사', '6461'], ['표면처리기능사', '6480'], ['금속재료시험기능사', '6490'],
            ['제선기능사', '6500'], ['제강기능사', '6515'], ['원형기능사', '6530'], ['압연기능사', '6543'], ['화학분석기능사', '6560'],
            ['유기농업기능사', '6592'], ['위험물기능사', '6697'], ['철도전기신호기능사', '6772'], ['전자캐드기능사', '6785'],
            ['전자기기기능사', '6790'], ['전자출판기능사', '6791'], ['석공예기능사', '6792'], ['제품응용모델링기능사', '6793'],
            ['전자계산기기능사', '6801'], ['전자부품장착기능사', '6835'], ['자동차보수도장기능사', '6836'], ['설비보전기능사', '6837'],
            ['정보기기운용기능사', '6892'], ['전파전자통신기능사', '6893'], ['전산응용조선제도기능사', '6910'], ['선체건조기능사', '6920'],
            ['정보처리기능사', '6921'], ['동력기계정비기능사', '6960'], ['측량기능사', '6980'], ['석공기능사', '6990'], ['철도토목기능사', '7010'],
            ['콘크리트기능사', '7020'], ['방수기능사', '7030'], ['전산응용건축제도기능사', '7061'], ['조적기능사', '7070'],
            ['전산응용토목제도기능사', '7072'], ['철근기능사', '7080'], ['금속재창호기능사', '7102'], ['플라스틱창호기능사', '7103'],
            ['미장기능사', '7110'], ['신재생에너지발전설비기능사(태양광)', '7114'], ['비계기능사', '7120'], ['기계정비기능사', '7121'],
            ['건축목공기능사', '7130'], ['건설재료시험기능사', '7132'], ['가구제작기능사', '7140'], ['건축도장기능사', '7150'],
            ['유리시공기능사', '7151'], ['실내건축기능사', '7152'], ['온수온돌기능사', '7161'], ['거푸집기능사', '7170'], ['도배기능사', '7180'],
            ['타일기능사', '7210'], ['염색기능사(침염)', '7301'], ['염색기능사(날염)', '7302'], ['시추기능사', '7330'], ['광산보안기능사', '7380'],
            ['금속도장기능사', '7450'], ['귀금속가공기능사', '7460'], ['방사선비파괴검사기능사', '7471'], ['초음파비파괴검사기능사', '7472'],
            ['자기비파괴검사기능사', '7473'], ['침투비파괴검사기능사', '7474'], ['목공예기능사', '7480'], ['축산기능사', '7481'],
            ['식육처리기능사', '7482'], ['천공기운전기능사', '7483'], ['인쇄기능사', '7524'], ['식품가공기능사', '7591'], ['잠수기능사', '7612'],
            ['종자기능사', '7620'], ['화훼장식기능사', '7625'], ['임업종묘기능사', '7630'], ['버섯종균기능사', '7631'], ['산림기능사', '7632'],
            ['임산가공기능사', '7644'], ['지적기능사', '7650'], ['도화기능사', '7660'], ['항공사진기능사', '7670'], ['광학기능사', '7671'],
            ['지도제작기능사', '7680'], ['수산양식기능사', '7700'], ['한복기능사', '7723'], ['에너지관리기능사', '7761'], ['전기기능사', '7780'],
            ['3D프린터운용기능사', '7785'], ['사진기능사', '7795'], ['컴퓨터그래픽스운용기능사', '7796'], ['웹디자인기능사', '7798'],
            ['타워크레인운전기능사', '7834'], ['컨테이너크레인운전기능사', '7835'], ['기중기운전기능사', '7861'], ['굴삭기운전기능사', '7862'],
            ['불도저운전기능사', '7863'], ['천장크레인운전기능사', '7864'], ['로더운전기능사', '7866'], ['롤러운전기능사', '7871'],
            ['지게차운전기능사', '7875'], ['광고도장기능사', '7888'], ['보석가공기능사', '7889'], ['도자공예기능사', '7890'], ['제과기능사', '7892'],
            ['제빵기능사', '7893'], ['조경기능사', '7900'], ['원예기능사', '7901'], ['신발류제조기능사', '7904'], ['이용사', '7908'],
            ['한식조리기능사', '7910'], ['양식조리기능사', '7911'], ['일식조리기능사', '7912'], ['중식조리기능사', '7913'], ['복어조리기능사', '7914'],
            ['조주기능사', '7916'], ['피아노조율기능사', '7917'], ['환경기능사', '7918'], ['영사기능사', '7920'], ['양화장치운전기능사', '7930'],
            ['양복기능사', '7931'], ['양장기능사', '7932'], ['미용사(일반)', '7937'], ['승강기기능사', '7940'], ['미용사(피부)', '7947'],
            ['미용사(네일)', '7957'], ['세탁기능사', '7960'], ['미용사(메이크업)', '7967'], ['화약취급기능사', '7970'], ['보석감정사', '7980'],
            ['떡제조기능사', '7992'], ['국제의료관광코디네이터', '9105'], ['직업상담사1급', '9510'], ['직업상담사2급', '9511'],
            ['사회조사분석사1급', '9520'], ['사회조사분석사2급', '9521'], ['전자상거래관리사1급', '9530'], ['컨벤션기획사1급', '9535'],
            ['컨벤션기획사2급', '9536'], ['소비자전문상담사1급', '9537'], ['소비자전문상담사2급', '9538'], ['임상심리사1급', '9539'],
            ['임상심리사2급', '9540'], ['텔레마케팅관리사', '9541'], ['멀티미디어콘텐츠제작전문가', '9545'], ['스포츠경영관리사', '9546'],
            ['컴퓨터활용능력1급', '9611'], ['컴퓨터활용능력2급', '9612'], ['전산회계운용사1급', '9621'], ['전산회계운용사2급', '9622'],
            ['전산회계운용사3급', '9623'], ['비서1급', '9937'], ['비서2급', '9938'], ['비서3급', '9939'], ['전자상거래운용사', '9940'],
            ['워드프로세서', '9961'], ['한글속기1급', '9971'], ['한글속기2급', '9972'], ['한글속기3급', '9973']]

    check = False
    for index in range(len(list)):
        if (list[index][0] == name):
            check = True
            break
    if(check):
        return list[index][1]
    else:
        return None


def certificate_date(msg):
    msg = msg.message.content
    msg = msg.split(' ')

    output = []
    embed = discord.Embed(title="", color=0x6E17E3)
    if(len(msg) != 3):
        embed.add_field(name="Error", value="양식을 지켜서 다시 적어주세요.", inline=False)
        output.append(embed)
        return output

    else:
        try:
            # 자격증 이름으로 탐색할 경우 list에서 자격증 코드를 찾아 검색하는 코드
            if (msg[2].isalpha()):
                code = certificate_code(msg[2])
                params = {f'serviceKey': f'{Key}', 'numOfRows': '20', 'pageNo': '1', 'dataFormat': 'json',
                          'implYy': f'{msg[1]}',
                          'qualgbCd': 'T', 'jmCd': f'{code}'}
            else:
                params = {f'serviceKey': f'{Key}', 'numOfRows': '20', 'pageNo': '1', 'dataFormat': 'json',
                          'implYy': f'{msg[1]}',
                          'qualgbCd': 'T', 'jmCd': f'{msg[2]}'}

            response = requests.get(date_url, params=params)
            contents = response.text
            json_ob = json.loads(contents)
            schedule = json_ob['body']['items']

            schedule_list = []
            year = schedule[0].get("implYy")
            count = schedule[0].get("implSeq")

            global information
            global information_name

            # api에서 일정 관련 내용들을 불러오기 위한 내용을 저장
            for i in range(len(information)):
                schedule_list.append([schedule[0].get(information[i])])


            # 해당 년도에 열리는 자격증 일정들을 출력시켜주는 코드
            for i in range(1, len(schedule)):
                if (year == schedule[i].get("implYy") and count == schedule[i].get("implSeq")):
                    for j in range(len(schedule_list)):
                        if (schedule_list[j][len(schedule_list[j]) - 1] != schedule[i].get(information[j])):
                            schedule_list[j].append(schedule[i].get(information[j]))
                if(year != schedule[i].get("implYy") or count != schedule[i].get("implSeq") or i == len(schedule) - 1):
                    embed = discord.Embed(title=f"{year}년도 제{count}회차 자격증일정", color=0x6E17E3)
                    for j in range(len(information_name)):
                        s = ""
                        if (j == 0):
                            for l in range(0, len(schedule_list[0])):
                                s += f"{schedule_list[0][l]} - {schedule_list[1][l]}\n"

                        elif (j == 1):
                            for l in range(0, len(schedule_list[2])):
                                s += f"{schedule_list[2][l]} - {schedule_list[3][l]}\n"

                        elif (j == 2):
                            for l in range(0, len(schedule_list[4])):
                                s += f"{schedule_list[4][l]}\n"

                        elif (j == 3):
                            for l in range(0, len(schedule_list[5])):
                                s += f"{schedule_list[5][l]} - {schedule_list[6][l]}\n"

                        elif (j == 4):
                            for l in range(0, len(schedule_list[7])):
                                s += f"{schedule_list[7][l]} - {schedule_list[8][l]}\n"

                        elif (j == 5):
                            for l in range(0, len(schedule_list[9])):
                                s += f"{schedule_list[9][l]}\n"

                        if (s != ""):
                            embed.add_field(name=information_name[j], value=s, inline=False)
                    output.append(embed)
                    schedule_list = []
                    year = schedule[i].get("implYy")
                    count = schedule[i].get("implSeq")
                    for j in range(len(information)):
                        schedule_list.append([schedule[i].get(information[j])])

            return output
        except:
            output = []
            embed = discord.Embed(title="", color=0x6E17E3)
            embed.add_field(name="Error", value="원인\n1. 일정이 없는 자격증\n2. 코드 혹은 자격증 명이 잘못되었을경우\n3. 오류", inline=False)
            output.append(embed)
            return output